{"modelTopology": {"backend": "tensorflow", "training_config": {"weighted_metrics": null, "metrics": [], "optimizer_config": {"class_name": "RMSprop", "config": {"epsilon": 1e-07, "rho": 0.8999999761581421, "decay": 0.0, "lr": 0.009999999776482582}}, "loss": "categorical_crossentropy", "sample_weight_mode": null, "loss_weights": null}, "keras_version": "2.1.6-tf", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"config": {"go_backwards": false, "implementation": 1, "recurrent_initializer": {"config": {"seed": null, "dtype": "float32", "gain": 1.0}, "class_name": "Orthogonal"}, "units": 128, "recurrent_dropout": 0.0, "batch_input_shape": [null, 40, 57], "recurrent_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "return_state": false, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "recurrent_constraint": null, "unroll": false, "name": "lstm", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "return_sequences": false, "activation": "tanh", "unit_forget_bias": true, "kernel_regularizer": null, "dropout": 0.0, "dtype": "float32", "recurrent_activation": "hard_sigmoid", "stateful": false, "bias_constraint": null, "use_bias": true}, "class_name": "LSTM"}, {"config": {"kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "name": "dense", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "softmax", "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "units": 57, "dtype": "float32", "trainable": true, "activity_regularizer": null, "use_bias": true}, "class_name": "Dense"}]}}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "name": "dense/kernel", "shape": [128, 57]}, {"dtype": "float32", "name": "dense/bias", "shape": [57]}, {"dtype": "float32", "name": "lstm/kernel", "shape": [57, 512]}, {"dtype": "float32", "name": "lstm/recurrent_kernel", "shape": [128, 512]}, {"dtype": "float32", "name": "lstm/bias", "shape": [512]}]}]}